[
  {
    "Title":"Buttons On! by Beau McCall",
    "Description":"Description\/brief of the exhibit",
    "Information":"Buttons are usually viewed as an everyday object serving the routine purpose of fastening one clothes. But creative artist Beau McCall, through his wearable and visual artwork, inspires us to see buttons anew. In his hands, buttons are transformed into dazzing maximalist fashion statements and awe-inspiring sculptural objects.\nButtons small, numble, and rendered virtually invisible - become giant, powerful, and visually arresting when MeCall transforms them with his unique artistic vision.\nHe reveals the limitless potential of the button to captivate, provoke, inspire, and to tell stories of joy, strength, and beauty.\nButtons On! marks the first ever retrospective for McCall. Proclaimed by American Creft magazine as the \"Button Man,\" McCall creates wearable and visual art by hand-sewing clothing buttons onto mostly upcycled fabrics, materials, and abjects. Buttons On! showcases pieces from MeCall's nearly forty-year career, the debut of several new works, and select archival material. Organized into several themes, the exhibition explores McCalls mastery of the button and offers commentary on topics such as pop culture and social justice.\nThe exhibition's four themes each represent a different facet of McCall's creative practice They include: \"Buttons on the Boy,\" an exploration of nearly forty-years of button embellished wearable art, \"Buttons on the Mind,\" a survey of over ten years of visual create using buttons as the primary medium; \"Buttons on the Soul,\" a collection of archival materials documenting McCall's career and evolution; and\n'Buttons Off,\" a selection of items from McCall's forays into buttonless wearable and visualart.\nNow, nearly four decades since his professional debut, McCall is receiving the recogrition he deserves for his cultural contributions and command of the button in art. This retrospective aims to amplify McCall's legacy as an artist whose works are among the mast original and innovative of our time.  A fun fact about McCall's work is that his signature is two fish buttons, because he's a pisces! May this exhibition inspire you to put your buttons on!"
  },
  {
    "Title":"Button Cuff: Joy  ",
    "Description":"A rectangular cuff-style band densely covered in brightly colored buttons and textured elements like smiley faces, flowers, and geometric shapes. It’s designed to be worn on the wrist.",
    "Information":"2025\nTactile Touchpoint: museum visitors may explore this touchpoint with clean hands and gentle pressure. Pieces may not be lifted or removed from the table. Please be respectful of the artist's work, and of other visitors who may wish to explore the touchpoint. Visitors may not touch other works on display in the Museum."
  },
  {
    "Title":"Button Cuff: Love",
    "Description":"A yellow cylindrical cup or container with its exterior decorated in a collage of various buttons and textured objects, creating a vibrant, three-dimensional tactile surface.",
    "Information":"2025\nClothing buttons for blind and low vision individuals including ceramic braille button and  \nplastic identi-buttons, assorted clothing buttons (metal, rhinestone, et al.), embroidery thread, upcycled levi's denim jacket cuff 2.5 x 12 in. Commissioned by the Museum of Craft and Design.\nTactile Touchpoint: museum visitors may explore this touchpoint with clean hands and gentle pressure. Pieces may not be lifted or removed from the table. Please be respectful of the artist's work, and of other visitors who may wish to explore the touchpoint. Visitors may not touch other works on display in the Museum."
  },
  {
    "Title":"Button Eye Patch: Hello, Smile",
    "Description":"A circular eye patch adorned with buttons of different sizes, shapes, and colors. It appears to have black elastic or string attached, indicating it's wearable.",
    "Information":"2025\nPlastic identi-buttons for blind and low vision individuals, assorted clothing buttons (Swarovski crystal, rhinestone, et al.), embroidery thread, upcycled eye patch (brand unidentified), 1x3 in diameter. Commissioned by the Museum of Craft and Design.\nTactile Touchpoint: museum visitors may explore this touchpoint with clean hands and gentle pressure. Pieces may not be lifted or removed from the table. Please be respectful of the artist's work, and of other visitors who may wish to explore the touchpoint. Visitors may not touch other works on display in the Museum."
  },
  {
    "Title":"Button Sneakers: Sole Power II",
    "Description":"A pair of black slip-on shoes decorated with straw-like fringe, large translucent buttons, and colorful embellishments, creating a playful, tactile design.",
    "Information":"2022\nAssorted buttons (horn, ceramic, glass, wood, rhinestone, bone, plastic, et al.), embroidery thread, raffia, upcycled Adidas nylon and rubber sneakers"
  },
  {
    "Title":"Button Sneakers: Sunny",
    "Description":"A pair of black sneakers with white soles, covered in a dense collage of yellow, black, and white buttons, including smiley faces and patterned designs, creating a vibrant, textured surface.",
    "Information":"2022\nAssorted buttons (cloth, rhinestone, plastic, et al.), embroidery thread, upcycled Adidas nylon and rubber sneakers\nSneakers and pop culture frequently influence one another. For example, the classic song My Adidas by Run-DMC was inspired by the sneaker brand and simultaneously helped increase Adidas's mass appeal. Furthermore, works by artists such as Andy Warhol have been adapted into sneaker brand collaborations. In this series, McCall contributes to this long-standing relationship between sneakers and pop culture. He upcycles Run-DMC-inspired Adidas to create work that celebrate mass culture.\nMoonwalk tributes recording artist Michael Jackson's popularization of the moonwalk dance. Sole Power II was inspired by the film Black Panther and its fictional city of Wakanda. All Sports draws a direct connection between sneakers and athletics where they are ubiquitous both for their functionality and aesthetics.\nSunny are of special importance as they also represent a recurring theme within McCall's work: joy. In several of his works, McCall includes yellow smiley face buttons. This popular ideogram and communication tool (e.g. emotions) represents joy worldwide.\nHere McCall places a smitey button on top of a saturation of mostly yellow buttons to evoke feelings of fun and whimsy."
  },
  {
    "Title":"Button Bolero: Chocolate Sprinkles",
    "Description":"A dark brown long-sleeve jacket densely covered with hundreds of multicolored buttons and textured objects across the front and collar, creating a vibrant, tactile mosaic.",
    "Information":"1990\nMetal and plastic buttons, embroidery thread, upcycled\nLevi's denim jacket\nA mélange of dazzling buttons is sprinkled over this brown denim bolero. When activated by bodily movements the work becomes musical as the jingling sounds of buttons charm the ear. This visual and \"eargasmic\" effect is what led to this bolero being included in the 1991 PBS production of The Colored Museum, a play by George C. Wolfe.\nWatch video footage in the Buttons on the Soul section."
  },
  {
    "Title":"Strange Beauties III: Antoine aka DeeDee Somemore, Beau McCall, and Tracy;\nStrange Beauties X: Antoine aka DeeDee Somemore, Beau McCall, and Tracy Monroe;\nAntoine aka DeeDee Somemore and Beau McCall I; Strange Beauties VIII: Tracy Monroe, Beau McCall, and Antoine aka DeeDee Somemore;\nStrange Beauties XIII: Antoine aka DeeDee Somemore, Tracy Monroe, and Beau McCall",
    "Description":"A gallery wall displaying six colorful collage artworks, each combining vintage photographs of Black individuals with vibrant backgrounds of buttons, beads, and cassette tapes, creating a textured and nostalgic celebration of culture and community.",
    "Information":"2020\nCollage printed with dye sublimation on aluminum\nFrom the book and series REWIND: MEMORIES ON REPEAT\nThe collages on display capture McCall with two of his deceased friends: Tracy Monroe and Antoine aka DeeDee Somemore. Along with McCall they formed a punk rock band named Strange Beauties.\nThe short-lived band (circa 1983-1986) created an important outlet for their creative expression and exploration of sexuality and gender-nonconforming identities.\nIn this collage, McCall reimagines one of the band's promotional photos. The eclectic choice of buttons, yellow highlighter, and striking lines across the band's countenances creates a punk rock aesthetic that is both edgy and glamorous. Each collage is created by hand using McCall's personal archival photos and papers, along with images from his button-embellished artwork.\nOnce completed the works are then scanned and printed on metal for luminosity. Additional collages in this series (included in McCall's\ndebut artists' book which you may peruse in the gallery) include eight of his other close friends. Collectively, the images capture the late 1970s to the mid-1990s, from Philadelphia to New York, during the LGBTQ+ rights movement, the height of disco music, and the AIDS crisis. Through this intimate series McCall represents the experiences, hopes, challenges, and heart of the LGBTQ+ community.\nPlease scan QR code to watch McCall discuss this series and to listen to the Strange Beauties demo recordings."
  },
  {
    "Title":"A Hartem Hangover: Pop, pOp, poP",
    "Description":"A sculptural bottle covered in gold, pearl, and clear buttons and beads, with clusters of translucent and metallic spheres cascading from the top and base, resting on a square beaded mat.",
    "Information":"2012\nPlastic buttons, metallic embroidery thread, wine bottle, denim, felt In the series \"A Hartem Hangover.\" McCall is inspired by joyous late-night parties from the Harlem Renaissance era to current times.\nEach bottle signifes a different type of partygoer and the relationship between spirits and social gatherings. Tilipsssyyy is the unabashed (and sometimes clumsy) party enthusiast who accidentally knocks over a bottle of wine. Pop, pOp, poP, is the party ringleader who makes every gathering a festive occasion as portrayed here with the arrangement of buttons into overflowing champagne bubbles. Collectively, the works reffect the use of spirits as a social lubricant for special occasions that often teads to humorous and pleasantly unforgettable memories."
  },
  {
    "Title":"Until We're Free",
    "Description":"A framed textile artwork featuring four hand-shaped fabric pieces arranged in a grid. All hands are facing upright decorated with rows of red and black buttons except for the top left hand, which is facing to the right and decorated with green buttons. The hands are on a burlap background, creating a bold, textured visual. ",
    "Information":"2012\nPlastic buttons, glow-in-the-dark embroidery thread, denim, burlap, plexiglass\nMcCall reimagines the U.S. flag using four crowns and the colors of the Pan- African flag: red, black, and green. Since its adoption by Marcus Garvey's United Negro Improvement Association (UNIA) in 1920, the flag has represented Black freedom and unity. Thus, McCall transforms the American flag into a symbol of the perseverance of Black people seeking freedom and social justice throughout the African diaspora.\nThe title is from the 1973 self-titled album by Elaine Brown (the hrst and only female leader of the Black Panther Party). With this work, McCall joins a chorus of artists who have used the Pan-African flag colors in their work(s) and\/or been inspired by the Black Panther Party such as David Hammons and Black Panther Party members Emory Douglas and Dorothy E. Hayes.\nThis was the hrst visual art piece McCall debuted after returning from his professional hiatus in 2012."
  },
  {
    "Title":"ABCDEFU",
    "Description":"A sculptural installation featuring a woven straw school desk and chair, with black buttons arranged on the desk surface spelling ABCDEFU, set against a wall with ruler segments radiating in a clock-like pattern, each filled with colorful buttons and beads.",
    "Information":"2016\nPolywood and plastic buttons, embroidery thread, cotton fabric, wood chair, rulers, yardsticks\nABCDEFU is informed by the traumatic physical and mental abuse, and racism, experienced by McCall and numerous students in Catholic school during the 1960s. The crosshair represents being a target of abuse by nuns. It is comprised of rulers and yardsticks which the nuns used to beat students. These items are adorned with buttons spelling out phrases such as \"Yes, sister,\" and \"No, sister.\" The school chair is the site of pain, reflection, healing, and holy revenge as McCall gives a middle finger to the Catholic school system using buttons spelling out \"FU.\" Adding levity, McCall arranges pink buttons into wads of chewing gum under the chair and desk.\nBack then, McCall was able to get some immediate revenge when a nun punched him and he courageously hit her back. But mostly during this challenging time, McCall's refuge was in creating art and here he once again demonstrates craft's cathartic power."
  },
  {
    "Title":"darkmuskoilegyptiancrystals&floridawater\/redpotionno.1",
    "Description":"A full-size bathtub sculpture covered entirely in red buttons, accented with clusters of multicolored buttons, beads, and textured decorations, creating a vibrant and whimsical surface. The tub sits on a golden platform.",
    "Information":"2014\nAssorted buttons (mother-of-pearl, rhinestone, cloth, et al.), embroidery thread, cotton fabric, cast iron tub. Commissioned by the Schomburg Center for Research in Black Culture.\nIn the creation of this work, McCall was inspired by the poem one from Ntozake Shange's choreopoem, for colored girls who have considered suicide \/ when the rainbow is enuf. He depicts the climax of the poem when lady in red, after giving herself to a lover\n-and cycling through emotions of possible regret or ambivalence-prepares a bath to wash away his scent and the glittering elements she uses to adorn her body. Thereby, McCall's imagining of this bathtub becomes a spiritual and ritualistic sanctuary and site of one's search for inner peace and self-love. He takes an everyday object and elevates it with his own commentary\nMcCall's intentionality in the buttons he selects for each work is brilliantly manifested here through buttons of iridescent, shimmering, and vibrant hues that elevate the work with visual splendor. The poetic approach to the source material's theme combined with skillful artistry place it in conversation with other artworks inspired by the work of writers such as Sir John Everett Millais's Ophelia (1851-1852) inspired by Shakespeare's Hamlet, and Salvador Dali's Mad Tea Party (1969) inspired by Lewis Carroll's Alice in Wonderland.\nScan the QR code to read one from Ntozake Shange's for colored girls..."
  },
  {
    "Title":"Button Sweater: Black",
    "Description":"A black long-sleeve sweater displayed in a glass case, with its front densely covered in an array of multicolored buttons of various sizes, creating a textured and patterned surface.",
    "Information":"1982\nPlastic buttons, embroidery thread, safety pins, upcycled wool sweater\nThis sweater is the earliest example of McCall's button-embellished wearable art. Thus, it illustrates key differences between his earlier and more advanced technique.\nThe Arst noticeable difference is the use of wool, unlike later works that primarily use upcycled denim. The switch in fabrics came after McCall learned that the wool knit material could not sustain the weight of an abundance of buttons. Secondly, unlike his later works, the buttons here are not sewn in a continuous thread pattern. Instead, the thread is cut off with the placement of each button. Finally, there Is a less layered fashion than McCall's later works, Here, the buttons are sewn onto the garment without a base layer of buttons ta conceal the original fabric.\nThis was Beau's first wearable piece, with a fun story about how he went to the club wearing it and at the end of the day the sweater was down to his knees given all the weight!\nWhat remains similar between this object and later works is McCall's mostly maximalist approach to button embellishment. Do you notice any other signiticant differences and\/or similarities?"
  },
  {
    "Title":"Hood Classic: Domino Kool",
    "Description":"A wall-mounted sculpture of a smiling pitcher pouring red liquid made of buttons and beads into a jar on a lace-covered shelf. The pitcher has a cartoonish face made from buttons and a textured, sparkling surface.",
    "Information":"2013\nPlastic buttons, embroidery thread, wood shelf, doilies, plastic jar, plexiglass\nThis work is part of McCall's \"Hood Classic\" series which finds him subverting the negative connotations attached with labeling items as \"hood.\" Yet, in this work he not only celebrates, but also calls into question the role such items play within our culture.\nFor McCall, Kool-Aid was a popular drink growing up in the \"hood.\" It simultaneously recalls the joys of youth while being a sugary unhealthy choice of beverage that was mostly targeted to economically disadvantaged families.\nMcCall captures the duality of this popular drink through his choice of two buttons for the Kool-Aid Man's eyes: a skeleton head (left) and a smiley face (right). Like some of the best pop art this work makes us simultaneously revere and question the mass culture products we (literally) consume.\nWhat does Kool-Aid mean to you?"
  },
  {
    "Title":"Button Speedo: Black Ice",
    "Description":"A black mannequin torso wearing a sculptural garment made of black fabric decorated with rows of green, silver, and orange buttons and plastic spool-like beads, forming a bold, tactile waistband and fringe.",
    "Information":"early 1990s\nPlastic buttons, embroidery thread, upcycled Gazelle swim briefs\nWith these button speedos, McCall playfully draws connections between buttons and sexuality. The word \"button\" has been used colloquially to reference a clitoris and breasts and one of the meanings behind the idiom \"pushing someone's buttons\" is to arouse someone's sexual interest.\nHere, McCall was specifically inspired by the male strippers of the 1980s, whose costumes became more creative and provocative than in the mid-to-late 1970s when male stripping first started to become popular. McCall's spin features his signature stacking technique with buttons cleverly arranged to emphasize one's bulge. Do these pieces push your buttons (wink-wink)?"
  },
  {
    "Title":"Button Jacket: Just Bee",
    "Description":"A yellow denim jacket adorned with a dense array of multicolored buttons on the shoulders, collar, cuffs, and seams, creating a bold contrast between the fabric and textured embellishments.",
    "Information":"1991\nPlastic buttons, embroidery thread, upcycled Levi's denim jacket\nJust Bee is one of McCall's earliest examples of him being inspired by the elements of our natural world. Taking his cue from the yellow denim, McCall accented the cuffs, sleeves, and hem in mostly black glossy buttons for a bee-like color pattern. The yoke area of the jacket buzzes with an abstract assemblage of multicolored buttons producing visual contrast and sweet honey for the eyes.\nIn 1991, acclaimed actor Michael K. Williams (The Wire) modeled this button jacket at the 11th Annual Monarch Awards at Sardi's Restaurant in New York City. View the original photo of Williams in this work in the Buttons on the Soul section."
  },
  {
    "Title":"Button Jacket: Candy",
    "Description":"A light blue denim jacket featuring a vibrant patch of multicolored buttons, beads, and trinkets densely covering the yoke and collar area, with black bead accents along the seams and edges.",
    "Information":"2020\nPlastic buttons, embroidery thread, upcycled Levi's denim jacket"
  },
  {
    "Title":"Hood Classic: The Ice Durag, 2021",
    "Description":null,
    "Information":"Assorted buttons (ceramic buttons collaboration with Glaze Girl Designs, and glo in the dark buttons)\nIn the series \"Hood Classic\" McCall references various themes that have historically been stereotypes as \"hood.\" This terminology has been interpreted as synonymous with \"low-class, ghetto, and unsophisticated.\" Yet, within Black culture, \"hood\" can also be a term of endearment. Thus, McCall attempts to subvert the negative connotations attached with labeling these terms as \"hood.\" he offers a more balanced perspective as he celebrates -- and at times call into question -- the role they play within our culture. \nThe durags within this series exhibit the beauty of Black natural hair and demonstrates an appreciation for durags -- used in the maintenance of Black hair and to accessorize one's outfit. Gaining increased popularity in the 19970s and exploding into the pop-culture through hip-hop during the 1990s and 2000s, the durag has been both criminalzed and popularized within the mainstream. "
  },
  {
    "Title":"Button Jacket: Born in Philly, Made in Harlem",
    "Description":"A black jacket displayed on a mannequin, embellished with a dense array of multicolored buttons across the shoulders, cuffs, and front panel, creating a vibrant, textured design that contrasts with the dark fabric.",
    "Information":"Assorted buttons (glass, wood, rhinestone, metal, ceramic, et. al) embroidery thread, ypcycled Levi's denim jacket \n\nSince the late 1990s McCall has created wearable art using upcycled denim, a durable and sustainable material that also has important links to the Black experience in America. These connections include the production of indigo to create the shortly denim uniform worn by the enslaved plantations, and the history of repurposing design. McCall's button works on denim pay tribute to this tradition of reclaimation and upcycling. \n\nBorn in Philly, Made in Harlem is the earliest example of McCall's use of denim. It is also the earliest example of the fine-tuned creative process with buttons in both his wearable and visual art. He begins by cutting the denim (if necessary) into a specific silhouette. Then, he sews a base layer of buttons onto the fabric. This foundation is usually of a uniform material and color the create a solid sheet or canvas. Simultaneously, while constructing the base layer, McCall views decorative buttons to convey the story, message, mood, or emotion the wishes to impart. \n\nMcCall chooses to work with denim not just because of its durability (each jacket can be 20-40lbs) , but also as an act of reclamation and elevation -- drawing on the history of many enslaved forced to wear denim as a strong fabric during indigo\/cotton slavery. \n\nHere, the message is pride as McCall celebrates his hometown of Philadelphia, PA (e.g. a pretzel shaped button regerencing this Philly food stand)."
  },
  {
    "Title":null,
    "Description":"A circular tabletop sculpture divided into sections, each filled with densely packed buttons, beads, and small glass elements in varied colors and textures, draped with rough, frayed brown burlap fabric cascading down the sides like roots.",
    "Information":"50 star buttons. Red whit and blue plaid fabric beneat the buttons. An interpretation of america. Stacking floral buttons representing the country blossomed on the back of enslavement further shown with African tribal mask buttons, burlap skirt on the table as they used to stack the cotton on the burlap. Underneath the table, the fabric is printed money, showing how American capitalism built on slavery"
  }
]